Revit 2027 API
IFCOpeningDimensions.Width Property
 The width of the opening.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
public:
property double Width {
	double get ();
	void set (double value);
}
member Width : float with get, set
Property Value
Double
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace